
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВыбраннаяУслуга") И Параметры.ВыбраннаяУслуга = "Выезд за грузом к складу отправителя" Тогда
		
		НоваяСтрока = Тариф.Добавить();
		НоваяСтрока.Представление = "Стандарт";
		НоваяСтрока.Значение = "5211f93e-4ba2-4406-bd2d-0f021f1987e3";
		
		НоваяСтрока = Тариф.Добавить();
		НоваяСтрока.Представление = "Экспрес";
		НоваяСтрока.Значение = "b8782ec5-c07a-4b26-9844-de3aedd53772";
		
		НоваяСтрока = Тариф.Добавить();
		НоваяСтрока.Представление = "Точное время";
		НоваяСтрока.Значение = "44c01960-8164-4316-b31f-378d6a4a0513";
		
		НоваяСтрока = Тариф.Добавить();
		НоваяСтрока.Представление = "Ночное время";
		НоваяСтрока.Значение = "64590fa9-19ac-4caf-aad5-0df11478fa6f";
		
	ИначеЕсли Параметры.Свойство("ВыбраннаяУслуга") И Параметры.ВыбраннаяУслуга = "Доставка груза к дверям получателя" Тогда
		
		НоваяСтрока = Тариф.Добавить();
		НоваяСтрока.Представление = "Стандарт";
		НоваяСтрока.Значение = "8a810b11-6184-4be5-b199-9d6285b6d4a1";
		
		НоваяСтрока = Тариф.Добавить();
		НоваяСтрока.Представление = "Экспрес";
		НоваяСтрока.Значение = "c9a0bfc5-9039-4453-9391-57c0cbffc1fe";
		
		НоваяСтрока = Тариф.Добавить();
		НоваяСтрока.Представление = "Точное время";
		НоваяСтрока.Значение = "d71b1869-c419-4a2b-8981-5aaa2f50a6b4";
		
		НоваяСтрока = Тариф.Добавить();
		НоваяСтрока.Представление = "Ночное время";
		НоваяСтрока.Значение = "dd8e2bef-1def-4c67-853c-f7beb0c11724";
			
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТарифВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповеститьОВыборе(Новый Структура("Наименование, ИД", Элементы.Тариф.ТекущиеДанные.Представление, Элементы.Тариф.ТекущиеДанные.Значение));
	
КонецПроцедуры
