
&НаСервере
Перем ТЗДопУслуг;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивДляИсключения = Новый Массив;
	
	Если Параметры.Свойство("ВыбранныеДопУслуги") Тогда
		
		МассивДляИсключения = Параметры.ВыбранныеДопУслуги;
		
	КонецЕсли;
	
	ЗаполнитьСписокДоступныхДопУслуг(МассивДляИсключения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхДопУслуг(МассивДляИсключения)
	
	Если МассивДляИсключения <> Неопределено Тогда
		
		Для Каждого Элемент Из МассивДляИсключения Цикл
			
			СтрокиТЗ = ТЗДопУслуг.НайтиСтроки(Новый Структура("ИД", Элемент));
			
			Для Каждого Строка Из СтрокиТЗ Цикл
				
				ТЗДопУслуг.Удалить(Строка);
				
			КонецЦикла;
					
		КонецЦикла;
		
	КонецЕсли;
	
	СписокДопУслуг.Загрузить(ТЗДопУслуг);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДопУслугВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповеститьОВыборе(Новый Структура("Наименование, ИД", Элементы.СписокДопУслуг.ТекущиеДанные.Наименование, Элементы.СписокДопУслуг.ТекущиеДанные.ИД));
	
КонецПроцедуры

#Область ЗаполнениеТЗДопУслуг

#Если Сервер Тогда
	
	ТЗДопУслуг = Новый ТаблицаЗначений;
	ТЗДопУслуг.Колонки.Добавить("Наименование");
	ТЗДопУслуг.Колонки.Добавить("ИД");
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Выезд за грузом к складу отправителя";
	НоваяСтрока.ИД = "11111111-1111-1111-1111-111111111111";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Доставка груза к дверям получателя";
	НоваяСтрока.ИД = "22222222-2222-2222-2222-222222222222";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Запрет на выдачу груза";
	НоваяСтрока.ИД = "2d832f7b-b6b0-11e5-bb36-0017a4770440";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Палетирование";
	НоваяСтрока.ИД = "4293056e-4cb1-406d-a2cd-e8f6d2ae6721";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Подъем на этаж ГО без лифта (каждое место до 25кг)";
	НоваяСтрока.ИД = "535f04ad-38ae-4e40-85a6-8e681e269c41";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Подъем на этаж ГО с лифтом (каждое место до 25 кг)";
	НоваяСтрока.ИД = "8a1b5394-fa1e-452c-9830-be0ae11fa2cc";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Подъем на этаж ГП без лифта(каждое место до 25 кг)";
	НоваяСтрока.ИД = "a2a82200-c29a-4a2e-9270-7bf5ae12a404";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Подъем на этаж ГП с лифтом (каждое место до 25 кг)";
	НоваяСтрока.ИД = "ccd257ff-1ffe-470b-89e8-39a46cad4cc5";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Стретчевание пленкой до 2 кг (до 0,05 м3)";
	НоваяСтрока.ИД = "4fdbcdc1-72ed-4e7b-bd69-6a8cd19ee00b";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Стретчевание пленкой до 25 кг (до 0,2 м3)"	"Услуги упаковки";
	НоваяСтрока.ИД = "94489b66-648c-4479-9aea-502f4e544c8b";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Стретчевание пленкой до 80 кг (до 0,3 м3)";
	НоваяСтрока.ИД = "ff3bc92c-de3c-46cc-a07a-127fc8006a0a";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Стягивание груза п/п стяжкой";
	НоваяСтрока.ИД = "efca98cc-d797-4b0d-9fcf-ddcf6b346715";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Укладка груза в гофроящик большой";
	НоваяСтрока.ИД = "29302b1f-d100-494e-ae8e-cb44bdce11fc";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Укладка груза в гофроящик малый";
	НоваяСтрока.ИД = "a6b3167d-8ad7-4654-9cc4-02d895b31d93";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Укладка груза в гофроящик средний";
	НоваяСтрока.ИД = "4802eb80-5d1b-4366-9da6-085a5e233e75";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Укладка груза в п/п мешок со стяжкой";
	НоваяСтрока.ИД = "2ada468c-36f9-11dd-a17b-001a4d3b885e";
	
	НоваяСтрока = ТЗДопУслуг.Добавить();
	НоваяСтрока.Наименование = "Упаковка документов";
	НоваяСтрока.ИД = "6d3a1ae4-7d47-45a0-8574-f134196a97ee";
	
#КонецЕсли

#КонецОбласти


