
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Соединение = САТ.ПолучитьHTTPсоединение();
	
	Операция = "v1.0/main/json/getRsp?language=ru";
	
	Запрос = САТ.ПолучитьHTTPЗапрос(Операция);
	
	Попытка
		
		Ответ = Соединение.Получить(Запрос);
		
		СтруктураОтвета = САТ.json_ПолучитьПараметры(Ответ.ПолучитьТелоКакСтроку());
		
		Если СтруктураОтвета.Успешно Тогда
			
			Для Каждого ЭлементМассива Из СтруктураОтвета.Массив Цикл
				
				НоваяСтрока = СписокОтделений.Добавить();
				НоваяСтрока.Отделение = ЭлементМассива.description;
				
				Структура = Новый Структура;
				Структура.Вставить("Адрес", ЭлементМассива.address);
				Структура.Вставить("Город", ЭлементМассива.description);
				Структура.Вставить("Email", ЭлементМассива.email);
				Структура.Вставить("Широта", ЭлементМассива.latitude);
				Структура.Вставить("Долгота", ЭлементМассива.longitude);
				Структура.Вставить("Телефон", ЭлементМассива.phone);
				Структура.Вставить("Расписание", ЭлементМассива.schedule);
				
				НоваяСтрока.ДанныеОтделения = Структура;
				
			КонецЦикла;
			
		Иначе
			
			САТ.СообщитьПользователю("Код ошибки: " + СтруктураОтвета.КодОшибки + Символы.ПС + СтруктураОтвета.ТекстОшибки);
			
		КонецЕсли;			
			
	Исключение
		
		САТ.СообщитьПользователю(ОписаниеОшибки());
		
	КонецПопытки;                  
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтделенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокОтделений.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ДанныеРСП", ТекущиеДанные.ДанныеОтделения,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры
